{
	"speaker-jens-ravens": {
		"firstname": "Jens",
		"lastname": "Ravens",
		"bio_html": "Jens is an iOS and OS X Developer, writing ObjC since 2006. Currently working at nerdgeschoss helping clients to create awesome apps. Organiser of the monthly swift.berlin meetup. Scaring people with functional concepts since 2014.",
		"www": "",
		"twitter": "jensravens",
		"photo_url": "/images/speakers/jens-ravens.jpg"
	},
	"speaker-tomasz-grynfelder": {
		"firstname": "Tomasz",
		"lastname": "Grynfelder",
		"bio_html": "Tomasz Grynfelder, Senior Software Engineer at Neofonie Mobile GmbH, mobile technologies freak highly focused on iOS development and security. Great fan of cycling and sailing.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/tomasz-grynfelder.jpg"
	},
	"speaker-pawel-dudek": {
		"firstname": "Paweł",
		"lastname": "Dudek",
		"bio_html": "I'm an iOS developer that has been building iOS apps for over 6 years now. I've shipped a variety of apps during my initial stage of career. Right now I'm focusing on building rich, content heavy and beautiful apps for Fortune 500 companies at a US-based startup Taptera. I've been publicly speaking and sharing my knowledge for over a year now. You can find full list of my talks, including videos and slides <a href=\"http://paweldudek.github.io/speaking/\">here</a>",
		"wwww": "http://paweldudek.github.io/speaking/",
		"twitter": "",
		"photo_url": "/images/speakers/pawel-dudek.jpg"
	},
	"speaker-pawel-gajda": {
		"firstname": "Paweł",
		"lastname": "Gajda",
		"bio_html": "Android Developer, laureate of the national finals of Microsoft Imagine Cup 2013. Associated with Android since 2010, when platform was taking its first steps. Enthusiast of JetBrains products (mainly IntelliJ IDEA). Student at Military University of Technology. Speaker at Mobile Warsaw. After-hours blogger, indie game developer and amateur runner.",
		"wwww": "",
		"twitter": "",
		"photo_url": "/images/speakers/pawel-gajda.jpg"
	},
	"speaker-miroslaw-stanek": {
		"firstname": "Mirosław",
		"lastname": "Stanek",
		"bio_html": "Wielki pasjonat technologii mobilnych, na zmianę programuje Androida i iOSa, na co dzień Head of Mobile w firmie Azimo Money Transfer. Po godzinach prowadzi bloga <a href=\"http://frogermcs.github.io/\">http://frogermcs.github.io/</a>, tweetuje o mobile, udziela się na lokalnych meetupach i dokłada swoje cegiełki w open source. Fan hackathonów, szczególnie tych bardziej hardware'owych.",
		"www": "http://frogermcs.github.io/",
		"twitter": "",
		"photo_url": "/images/speakers/miroslaw-stanek.jpg"
	},
	"speaker-krzysztof-kocel": {
		"firstname": "Krzysztof",
		"lastname": "Kocel",
		"bio_html": "Developer Androida w Allegro od 2012.<br>Pasjonat technologii mobilnych.<br>Prelegent na konferencji mobilization 2013.<br>Prywatnie piwowar domowy.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/krzysztof-kocel.jpg"
	},
	"speaker-witold-wysota": {
		"firstname": "Witold",
		"lastname": "Wysota",
		"bio_html": "Inżynier oprogramowania z wieloletnim doświadczeniem, wielki miłośnik Qt, którym zajmuje się od kilkunastu lat, uczestnik wcześniejszych konferencji Mobilization.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/witold-wysota.jpg"
	},
	"speaker-michal-charmas": {
		"firstname": "Michał",
		"lastname": "Charmas",
		"bio_html": "Aktualnie freelancer zajmujący się aplikacjami mobilnymi na platformę Android, co-founder startupu eWejściówki.pl i trener w firmie Bottega IT Solutions. Pasjonat Androida praktycznie od momentu jego powstania. W pracy szczególny nacisk kładzie na jakość zarówno pod względem architektury i czystości kodu jak i wydajności. Po pracy gitarzysta porwany przez muzykę.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/michal-charmas.jpg"
	},
	"speaker-maciej-gorski": {
		"firstname": "Maciej",
		"lastname": "Górski",
		"bio_html": "Maciej is a passionate Android developer. He cares about writing cleaner code and less of it. He is spending time to automate things to save even more time. He also bikes a lot and would love to be able to code while doing it… using only mind controlled wearables or bikeables.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/maciej-gorski.jpg"
	},
	"speaker-piotr-krystyniak": {
		"firstname": "Piotr",
		"lastname": "Krystyniak",
		"bio_html": "Moje zainteresowania zawodowe koncentrują się wokół platformy Android, której jestem szczerym entuzjastą. Na co dzień pracuję w Appunite budując aplikacje mobilne. Poza pracą również czynnie uczestniczę w różnorodnych eventach programistycznych - jestem m.in.  współorganizatorem spotkań z cyklu Poznań Android Developer Group, na których wielokrotnie miałem okazję przeprowadzać prelekcje.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/piotr-krystyniak.jpg"
	},
	"speaker-peter-tuszynski": {
		"firstname": "Peter",
		"lastname": "Tuszyński",
		"bio_html": "Mobile developer since early days of iPhone/Android platforms, product engineer. Co-founder of Appvetica lab. Almost-a-pilot :). Spoke at Mobilization in 2012 and a bunch of other conferences",
		"www": "www.appvetica.com",
		"twitter": "dusker",
		"photo_url": "/images/speakers/peter-tuszynski.jpg"
	},
	"speaker-fokke-zandbergen": {
		"firstname": "Fokke",
		"lastname": "Zandbergen",
		"bio_html": "Fokke is a Developer Evangelist for Appcelerator, the company behind Titanium. Before that, he was already active in the Titanium community for a long time with initiatives like gitt.io, ticons.fokkezb.nl, tidev.io, contributions to Alloy and Alloy widgets and by leading the Dutch user group. He has a passion for understanding new technologies by using and hacking them and sharing from that experience.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/fokke-zandbergen.jpg"
	},
	"speaker-krzysztof-siejkowski": {
		"firstname": "Krzysztof",
		"lastname": "Siejkowski",
		"bio_html": "Po trzech latach zawodowego programowania wie tylko tyle, że nic nie wie. Pisał w Javie, Scali i Swifcie, ale Objective-C, pierwsza miłość, zajmuje w jego sercu specjalne miejsce. Wierzy, że wszyscy deweloperzy to jedna rodzina, i chce tę świadomość krzewić organizując spotkania MobileWarsaw oraz konferencję Codepot. Robi co może dla rozwoju aplikacji mobilnych w firmie TouK. ",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/krzysztof-siejkowski.jpg"
	},
	"speaker-zbigniew-szymanski": {
		"firstname": "Zbigniew",
		"lastname": "Szymański",
		"bio_html": "Senior Developer / Architect at <a href=\"wire.com\">wire.com</a>, responsible for keeping Android Wire app in sync. Focusing on Android development in Scala, obsessed with idea of creating apps with simpler and more powerful abstractions",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/zbigniew-szymanski.jpg"
	},
	"speaker-lukasz-olejarczuk": {
		"firstname": "Łukasz",
		"lastname": "Olejarczuk",
		"bio_html": "Łukasz is a technology evangelist and software developer at Bank Zachodni WBK where he is creating a wide variety of state-of-the-art applications. Now he is strongly focused on mobile hybrid applications in the enterprise world.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/lukasz-olejarczuk.jpg"
	},
	"speaker-krzysztof-scira": {
		"firstname": "Krzysztof",
		"lastname": "Ścira",
		"bio_html": "Prezes i front-end developer firmy desi9n.pl sp. z o. o. - tworzącej hybrydowe aplikacje mobilne (iOS, Android, WindowsPhone), aplikacje i strony internetowe RWD. Wielokrotny prelegent na wydarzeniach związanych z programowaniem urządzeń mobilnych i programowaniem front-end. Na co dzień pracuje w HTML5, CSS3, SASS / SCSS, AngularJS i oczywiście Cordova / Phonegap - czy to jako developer w desi9n.pl czy to trener programowania w firmie SAGES. W wolnych chwilach pasjonat boksu olimpijskiego.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/krzysztof-scira.jpg"
	},
	"speaker-michal-tuszynski": {
		"firstname": "Michał",
		"lastname": "Tuszyński",
		"bio_html": "Programista iOS w aplikacji Tidal związany z polską sceną startupową oraz miłośnik wszelkich nowych technologii",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/michal-tuszynski.jpg"
	},
	"speaker-marin-todorov": {
		"firstname": "Marin",
		"lastname": "Todorov",
		"bio_html": "Marin Todorov is an independent iOS consultant and publisher. He started developing on an Apple ][ more than 20 years ago and keeps rocking till today. Meanwhile he has worked in great companies like Monster Technologies and Native Instruments, has lived in 4 different countries, and (more recently) is one the founding members of the raywenderlich.com tutorial team. Besides crafting code, Marin also enjoys bloging on www.touch-code-magazine.com, writing books www.ios-animations-by-tutorials.com, and speaking at mobile conferences. He sometimes open sources his code. He walked the way to Santiago. More info & prev. speaking experience <a href=\"http://www.underplot.com/#speaking\">here</a>",
		"www": "http://www.underplot.com/#speaking",
		"twitter": "",
		"photo_url": "/images/speakers/marin-todorov.jpg"
	},
	"speaker-edwin-adriaansen": {
		"firstname": "Edwin",
		"lastname": "Adriaansen",
		"bio_html": "Edwin Adriaansen has been programming since the early nineties. He worked for several IT companies and joined TomTom 7 years ago. Currently he is managing the teams responsible for the software running on the TomTom navigation devices. Furthermore he has a personal interest in new technical developments (geeky products), mechanical watches and good food.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/edwin-adriaansen.jpg"
	},
	"speaker-daniel-rurarz": {
		"firstname": "Daniel",
		"lastname": "Rurarz",
		"bio_html": "Scrum Master w Seamless Payments. Uczestniczył w wielu projektach informatycznych od systemów operacyjnych na kary bankomatowe po High Performance Computing. Zaczynał od programowania, prowadził projekty informatyczne, najwięcej satysfakcji daje mu jednak praca z zaangażowanymi samozorganizowanymi zespołami i usprawnianie całej organizacji w roli Scrum Mastera.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/daniel-rurarz.jpg"
	},
	"speaker-lukasz-szadkowski": {
		"firstname": "Łukasz",
		"lastname": "Szadkowski",
		"bio_html": "UX Designer w Seamless Payments, autor bloga UserExpired.com. Wierzy w rolę UX we wspieraniu biznesu. Wie, że ta dziedzina to dużo więcej niż diagramy, mapy, czy makiety. To tylko środki wspierające kreowanie wizji, gdzie główną rolę gra Klient i jego potrzeby. Myśli o UX w kontekście zachowań konsumenckich, możliwości technologicznych, trendów rynkowych, ale przede wszystkim spełniania oczekiwań użytkowników.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/lukasz-szadkowski.jpg"
	},
	"speaker-lena-rodziewicz": {
		"firstname": "Lena",
		"lastname": "Rodziewicz",
		"bio_html": "Wielka orędowniczka WebComponents oraz pierwsza osoba do testowania  wszelkich nowości technologicznych. Nieszczęśliwie zakochana w Internet of Things. Stara się, z różnym skutkiem, chociaż trochę ulepszyć świat z użyciem techniki. W branży od 10 lat oraz wiele nieprzespanych nocy. Od ponad 4 lat kieruje zespołami programistów pod flagą Mobica Limited. Odpowiedzialna za dostarczanie ekspertyzy technicznej w zakresie JavaScript jako wsparcie dla biura CTO. Ma kota o imieniu Java. Na Mobilization po raz trzeci.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/lena-rodziewicz.jpg"
	},
	"speaker-maciej-chwiloc": {
		"firstname": "Maciej",
		"lastname": "Chwiłoc",
		"bio_html": "Dyrektor Rozwoju Produktu Grupy Pracuj S.A. pracujący na co dzień z ponad 80 osobowym zespołem developerów – pasjonatów. W wolnych chwilach budowy dronów i lotów FPV.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/maciej-chwiloc.jpg"
	},
	"speaker-cezary-kapicki": {
		"firstname": "Cezary",
		"lastname": "Kąpicki",
		"bio_html": "Starszy programista w Grupie Pracuj S.A.. Zawodowo zajmuje się programowaniem aplikacji webowych w C# i PHP.  Wolny czas spędza na wielogodzinnych spacerach i poznawaniu nowych miejsc.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/cezary-kapicki.jpg"
	},
	"speaker-jacek-rondio": {
		"firstname": "Jacek",
		"lastname": "Rondio",
		"bio_html": "Senior Software Engineer w firmie HARMAN Connected Services zajmujący się głównie rozwijaniem aplikacji na platformę Android, nie bojący się jednak siegać do głębszych warstw systemu. Obecnie związany z branżą automotive, wcześniej z accessibility i komercyjnymi aplikacjami jednego z operatorów komórkowych. Entuzjasta nowych technologii mobilnych, wciąż szukający nowych technologicznych wyzwań.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/jacek-rondio.jpg"
	},
	"speaker-anton-miniailo": {
		"firstname": "Anton",
		"lastname": "Miniailo",
		"bio_html": "Inżynier oprogramowania Android z 5 letnim doświadczeniem. Entuzjasta Javy, lubiący wyzwania z zakresu architektury oprogramowania. Interesuje sie zarówno pracą z software jak i middleware. Do HARMAN Connected Services dołączył rok temu.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/anton-miniailo.jpg"
	},
	"speaker-rafal-szpoton": {
		"firstname": "Rafał",
		"lastname": "Szpoton",
		"bio_html": "A very retro gadgets maniac.. He used to know how to program modern windows UI in MS DOS using Turbo Pascal 7.0 but he doesn’t know it anymore J As his primary field of expertise disappeared in the mists of history he moved to more modern environments like iOS or Android.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/rafal-szpoton.jpg"
	},
	"speaker-tomasz-netczuk": {
		"firstname": "Tomasz",
		"lastname": "Netczuk",
		"bio_html": "Programista nie trzymający się kurczowo jednej platformy. Na koncie ma: frontendy webowe, aplikacje iOS, backendy w node i pythone, devopowanie... Organizator Warsjawy 2014, Codepota 2015, wcześniej prowadził wykład o Foundation na Mobilization oraz warsztaty o tym frameworku na Warsjawie 2013.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/tomasz-netczuk.jpg"
	},
	"speaker-karol-kowalski": {
		"firstname": "Karol",
		"lastname": "Kowalski",
		"bio_html": "Karol began his journey into the world of developers two years ago. From the very first day he learned best practices from Uncle Bob and after one year in Impaq, he took a fancy to Groovy and Android development. Since march he combined both these interests in ElPassion as Android-Groovy Dev.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/karol-kowalski.jpg"
	},
	"speaker-pawel-junak": {
		"firstname": "Paweł",
		"lastname": "Junak",
		"bio_html": "Wroclaw University of Technology graduate, interested in Android from the first Google announce. After few years in Film industry, engineering mindset and love for technology made him come back to roots and start programming full time. Now he works in Polidea making great mobile apps for the whole world.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/pawel-junak.jpg"
	},
	"speaker-konrad-krakowiak": {
		"firstname": "Konrad",
		"lastname": "Krakowiak",
		"bio_html": "Senior Software Engineer w Polidea. Prawie 6 lat doświadczenia z czego 5 jako programista na platformę Android. Doświadczenie prelegenckie: wykład na Politechnice Wrocławskiej, (o bibliotece SPen Samsunga), wykład o AndEginie, (w ramach konkursu z Samsunga), wykład na Politechnice Warszawskiej w ramach przedmiotu Szlif, mentor na CodePot 2015",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/konrad-krakowiak.jpg"
	},
	"speaker-slawomir-jasek": {
		"firstname": "Sławomir",
		"lastname": "Jasek",
		"bio_html": "Konsultant bezpieczeństwa z kilkunastoletnim doświadczeniem. Jako programista tworzył bezpieczne systemy certyfikowane dla użytku w instytucjach rządowych. Jako pentester wskazał krytyczne podatności w dziesiątkach aplikacji - www, mobilnych, embedded - wiodących firm z sektora finansowego, IT, branży internetowej, nowych technologii.  Entuzjasta innowacyjnych rozwiązań i gadżetów, a zwłaszcza możliwości ich ataku. Prelegent wielu polskich i zagranicznych konferencji. Od 10 lat w firmie SecuRing doradza bezpieczne rozwiązania dla różnego typu aplikacji - coraz częściej już od etapu projektowania.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/slawomir-jasek.jpg"
	},
	"speaker-sebastian-kacprzak": {
		"firstname": "Sebastian",
		"lastname": "Kacprzak",
		"bio_html": "Sebastian pracuje jako Solutions Architect w firmie Outline. Pasjonat kasowania kodu, upraszczanie architektury i wyodrębniania powtarzalnych fragmentów kodu jako open sourcowe biblioteki. Prowadził pierwszą edycję Warsaw Android Livecode. Po pracy lubi fotografować.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/sebastian-kacprzak.jpg"
	},
	"speaker-pawel-wojdera": {
		"firstname": "Paweł",
		"lastname": "Wojdera",
		"bio_html": "I'm goal-oriented mobile evangelist with technical background and strong communication skills. Main assumption is to be 1% better than yesterday, so day-by-day I’m studying details of programming Android platform, exploring Android Arsenal and following influencers via Github. Personally, I can't wait when Internet of Things will glut the market, beacons technology will be on daily basis and driveless cars will drop me anywhere I want.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/pawel-wojdera.jpg"
	},
	"speaker-aleksander-piotrowski": {
		"firstname": "Aleksander",
		"lastname": "Piotrowski",
		"bio_html": "Kiedyś backendowiec, dziś deweloper mobilny. Ze względu na wiek piastujący stanowisko Senior Android Developer od pierwszego dnia jako androidowiec.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/aleksander-piotrowski.jpg"
	},
	"speaker-michal-wlodarczyk": {
		"firstname": "Michał",
		"lastname": "Włodarczyk",
		"bio_html": "Senior Software Engineer w firmie Open-RnD. Od 4 zajmuje się rozwijaniem aplikacji mobilnych na platformę Android. Uczestnik studiów doktoranckich na Politechnice Łódzkiej, w Katedrze Mikroelektroniki i Technik Informatycznych (wydział Elektroniki, Elektrotechniki, Informatyki i Automatyki). Odpowiedzialny za przedmioty \"Systemy operacyjne na platformach mobilnych\", \"Przetwarzanie w chmurze dla aplikacji mobilnych\" oraz \"m-Commerce\". Autor licznych publikacji z zakresu biometrii i przetwarzania danych na platformie Android. Więcej informacji na profilu na <a href='https://pl.linkedin.com/pub/michał-włodarczyk/33/3a4/b08'>LinkedIn</a>",
		"www": "https://pl.linkedin.com/pub/michał-włodarczyk/33/3a4/b08",
		"twitter": "",
		"photo_url": "/images/speakers/michal-wlodarczyk.jpg"
	},
	"speaker-michal-szczepanik": {
		"firstname": "Michał",
		"lastname": "Szczepanik",
		"bio_html": "Badacz, projektant, programista. Od wielu lat związany z branżą mobilną, swoją przygodę zaczynał JME, Symbianem, Blackberry, obecnie programista Androida w BLStream. Założyciel  Meet.Mobile Wrocław. Fan planszówek i nowych technologii oraz prelegent wielu eventów mobilnych.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/michal-szczepanik.jpg"
	},
	"speaker-sebastian-gos": {
		"firstname": "Sebastian",
		"lastname": "Gos",
		"bio_html": "A special Agent 007 on Her Majesty Secret Frontend Services which include but is not limited to: UX espionage, mobile warfare discovery, UI takeovers. Currently under cover at HP Polska working on his another top secret assignment. Big fan of  rock stars, leisure activities like guitar playing and sailing culinary travels. During his missions a very active Android and iOS user. A big fan of Moneypenny.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/sebastian-gos.jpg"
	},
	"speaker-lech-migdal": {
		"firstname": "Lech",
		"lastname": "Migdal",
		"bio_html": "A big fan of simplicity and usability.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/lech-migdal.jpg"
	},
	"speaker-michal-aleksander": {
		"firstname": "Michał",
		"lastname": "Aleksander",
		"bio_html": "Z wykształcenia dziennikarz, który w pewnym momencie swojego życia bardzo skręcił w stronę (bliskiej mu od zawsze) technologii i projektowania. Przez 5 lat projektował dla kluczowego serwisu e-commerce w Europie Środkowo-Wschodniej, mocno skupiając się na mobilności, rozpoznaniu potrzeb użytkownika oraz naturalnym kontekście użycia projektowanych produktów. Obecnie Interaction Designer i Design Team Manager w przedsionku technologicznym największej na świecie firmy edukacyjnej - Pearson English Technologies, w której mocno skupia sieę na porządkowaniu procesów, wypracowywaniu najlepszych podejść projektowych oraz metodach warsztatowych, w które angażuje reprezentantów wszystkich działów w firmie. Autor elektronicznej książki <a href='http://www.ibuk.pl/fiszka/141731/jak-stac-sie-lepszym-projektantem-ux.html'>Jak stać się lepszym projektantem UX</a>. Prelegent na UXCampie (Gdynia, 2014), World of Usability Day (Gdynia, 2014) oraz Product Campie (Gdynia, 2015).",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/michal-aleksander.jpg"
	},
	"speaker-pawel-urban": {
		"firstname": "Paweł",
		"lastname": "Urban",
		"bio_html": "Developer z krwi i kości od 6 lat. Do tej pory związany z firmami takimi jak LG Electronics, Allegro oraz PayU. Pasjonat świata mobilnego, szczególnie z zielonym robotem w tle.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/pawel-urban.jpg"
	},
	"speaker-lukasz-krupa": {
		"firstname": "Łukasz",
		"lastname": "Krupa",
		"bio_html": "Aktualnie odpowiedzialny za rozwój działu rozwiązań mobilnych w R&D Viessmann we Wrocławiu. Miłośnik zwinnych metod rozwoju produktów i filozofii Kaizen. Swoją przygodę z IT rozpoczynał jako tester oprogramowania i przez ostatnie 10 lat uczestniczył w kilkudziesięciu projektach współpracując ze znanymi firmami branży IT w różnorodnych rolach m.in. Inżyniera rozwoju oprogramowania, kierownika projektu, lidera zespołu, kierownika działu, Agile Coacha. Inicjator społeczności „Agile Wrocław”, konsultant zwinnych metod, praktyk Scruma, współorganizator pierwszego na świecie szkolenia o Scrumie w formie gry miejskiej. Potwierdzeniem jego kompetencji są liczne międzynarodowe certyfikaty: PMI-ACP, PRINCE-2, IPMA-D, PSM I, CSM oraz ISTQB Foundation. W tym roku występował m.in. na konferencji Scrum Days, Testing Cup oraz wielokrotnie na spotkaniach branżowych.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/lukasz-krupa.jpg"
	},
	"speaker-michal-majcherski": {
		"firstname": "Michał",
		"lastname": "Majcherski",
		"bio_html": "Software Engineer w Seamless Payments. Podczas blisko 8 letniej kariery brał udział w tworzeniu i utrzymywaniu oprogramowania zarówno dla dużych korporacji jak i szybko dostosowujących się do aktualnych potrzeb rynku kilkuosobowych startupów. Zwolennik czystego kodu i dobrych praktyk wytwarzania oprogramowania.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/michal-majcherski.jpg"
	},
	"speaker-filip-miloszewski": {
		"firstname": "Filip",
		"lastname": "Miłoszewski",
		"bio_html": "Co-founder of Listonic, one of the most popular Polish apps, available on Android, iPhone, Windows Phone and few other platforms. Working on mobile apps since 2007. Speaker on many conferences including: Internet Beta, Mobile Standard, Mobile Trends for Business, Akademia Mediarun, App Academy, Jungle Web, Łódź WiOSłuje, MIT and more.",
		"www": "",
		"twitter": "",
		"photo_url": "/images/speakers/filip-miloszewski.jpg"
	}
}