{
	"talk-clean-architecture": {
		"title": "Przejrzysty i testowalny kod na Androidzie? Spróbujmy z Clean Architecture",
		"description_html": "Pisanie dobrego oprogramowania na platformę Android jest trudnym zadaniem. Jednym z dużych problemów, zwłaszcza w przypadku sporych aplikacji, może być podział logiki aplikacji tak, aby nasze Activity czy Fragmenty nie były nią przeładowane oraz aplikacja była podatna na testowanie jednostkowe. Szukając pomysłu na architekturę aplikacji, która będzie dobrze się skalowała wraz z rozwojem projektu, natknąłem się na Clean Architecture zaproponowaną przez Boba C. Martina. Podczas prezentacji zobaczymy czy i jak CA sprawdza się w przypadku aplikacji mobilnych na Androida i na co pozwala jej zastosowanie. Oczywiście nie pominiemy takich kluczowych kwestii jak pogodzenie tego wszystkiego z wszechobecną na Androidzie asynchronicznością.",
		"speakers_keys": ["speaker-michal-charmas"],
		"language": "PL"
	},
	"talk-swift-and-objective-c-interoperability": {
		"title": "Swift and Objective-C interoperability",
		"description_html": "Have a look at how to make Swift and Objective-C interoperability seamless. Basics of including Swift code in your new or existing Objective-C based projects and helping yourself when you want to deliver some parts of Swift-based application using Objective-C code.",
		"speakers_keys": ["speaker-tomasz-grynfelder"],
		"language": "EN"
	},
	"talk-espressive-functional-testing-with-espresso": {
		"title": "Espressive functional testing with Espresso",
		"description_html": "Testing mobile apps is not easy. If you wanted to test \"Hello World\" app with a button and text label, that wouldn't be really hard. But our apps do a lot more. They are calling RESTful services, checking on user's GPS location or using Facebook or Google+ login buttons, which connect to network themselves. How do you test that? I want to show you my approach to functional testing with Espresso and a bit of dependency inversion magic. Do you have a feeling testing network error conditions is hard or cumbersome when done manually. Turns out it's even easier to automatically test it than \"the happy path\". You will see real code from production app, so remember to drink a shot of espresso before joining this session.",
		"speakers_keys": ["speaker-maciej-gorski"],
		"language": "EN"
	},
	"talk-kotlin-for-android": {
		"title": "Kotlin for Android",
		"description_html": "Wprowadzenie do Kotlina na Androida. Omówienie składni języka oraz jego kluczowych aspektów umożliwiających znacznie szybsze pisanie aplikacji na platformę Android. Porównanie Kotlina z alternatywnymi językami JVM. Zakończone sesją Q&A.",
		"speakers_keys": ["speaker-pawel-gajda"],
		"language": "PL"
	},
	"talk-reaktywne-programowanie-z-rxjava": {
		"title": "Reaktywne programowanie z RxJava",
		"description_html": "Programowanie reaktywne jako lekarstwo na ból głowy związany z kodem asynchronicznym. W czasie mojej prezentacji przedstawię fundamentalne idee stojące za tym paradygmatem oraz zademonstruję od podstaw jak tworzyć reaktywne rozwiązania. Wszystko to na przykładzie biblioteki RxJava na platformie Android.",
		"speakers_keys": ["speaker-piotr-krystyniak"],
		"language": "PL"
	},
	"talk-hipster-oriented-programming": {
		"title": "Hipster Oriented Programming",
		"description_html": "Not sure if you should order a burrito or a monad for lunch? Get a quick overview of Object Oriented, Functional and Protocol Oriented programming in Swift 2 and learn what all that fuss is about and why you should care.",
		"speakers_keys": ["speaker-jens-ravens"],
		"language": "EN"
	},
	"talk-behavior-driven-development": {
		"title": "Behavior Driven Development",
		"description_html": "Building apps is hard. But making sure that apps don't break in the process of adding new functionality is even harder. Your code is constantly changing. If you're lucky your requirements aren't changing that much, but you probably live in the world of constant change. And that change poses a certain risk. Things sometimes might go missing. Pieces of code, pieces of behavior that should be there. But are not. In this talk you'll learn how you can avoid falling into this trap by leveraging behavior driven development. You'll find out how to write tests for iOS and what technologies you can use to keep your code safe and sound. ",
		"speakers_keys": ["speaker-pawel-dudek"],
		"language": "EN"
	},
	"talk-dagger-2-dependency-injection-w-kodzie-produkcyjnym": {
		"title": "Dagger 2 - Dependency Injection w kodzie produkcyjnym",
		"description_html": "Dagger 2 to pierwszy framework do Dependency Injection, który można uznać za Android friendly. Nie korzysta z refleksji, jest tak szybki jak ręcznie pisany kod, nie wymaga dodatkowej konfiguracji Proguarda. W związku z tym, że wartość Dependency Injection wzrasta wraz ze złożonością projektu, na prezentacji pokazane zostaną przykłady użycia Daggera w kodzie produkcyjnym. Zobaczymy co dają nam Scope'y, jak Dagger 2 pomaga w różnych typach testów, jak unikać wycieków pamięci oraz jak Dagger 2 pomaga w pracy zespołowej.",
		"speakers_keys": ["speaker-miroslaw-stanek"],
		"language": "PL"
	},
	"talk-watch-out-for-the-watch": {
		"title": "Watch out for the watch",
		"description_html": "Apple Watch might be the most polarising, controversial and innovative product added to Apple's portfolio in the last few years. Let's take a brief look to see if it's worth it, and first and foremost how to bring our apps to people's wrists.",
		"speakers_keys": ["speaker-peter-tuszynski"],
		"language": "EN"
	},
	"talk-app-indexing-i-deep-linking-w-aplikacjach-androidowych": {
		"title": "App Indexing i Deep linking w aplikacjach Androidowych",
		"description_html": "Podczas prelekcji dowiesz się w jaki sposób wzbogacić aplikację o wsparcie dla App Indexingu, pozwoli to zwiększyć zaangażowanie obecnych użytkowników oraz przyciągnąć nowych. Zobaczysz na jakie problemy można natknąć się podczas implementacji, jak można sobie z nimi poradzić, a także poznasz kilka sztuczek ułatwiających wdrożenie App Indexingu.",
		"speakers_keys": ["speaker-krzysztof-kocel"],
		"language": "PL"
	},
	"talk-qtquick-spotyka-html": {
		"title": "QtQuick spotyka HTML",
		"description_html": "Celem prezentacji jest pokazanie w jaki sposób połączyć ze sobą dwa światy -- oferowany przez Qt wydajny i prosty w użyciu mechanizm QtQuick/QML oraz niezwykle popularny HTML. Zademonstrowane zostanie, jak osadzić w scenie QtQuickowej treść HTML i jak komunikować ze sobą skrypt QML i JavaScript na stronie.",
		"speakers_keys": ["speaker-witold-wysota"],
		"language": "PL"
	},
	"talk-dobry-zwyczaj-nie-odziedziczaj": {
		"title": "Dobry zwyczaj: nie odziedziczaj",
		"description_html": "Swift zainspirował środowisko programistów OSX/iOS do poszukiwań w miejscach, w które się dotąd nie zapuszczali. Na przykład w rejony programowania funkcyjnego. My też się tam wybierzemy, żeby przejrzeć kilka prostych koncepcji i technik gotowych do natychmiastowego wykorzystania w aplikacjach mobilnych. W podróż zabierze nas rollercoster emocji: radość na widok znajomych problemów, przed którymi programowanie funkcyjne nas chroni, oraz smutek na widok nowych, które wprowadza.",
		"speakers_keys": ["speaker-krzysztof-siejkowski"],
		"language": "PL"
	},
	"talk-reactive-ui-on-adroid-with-scala": {
		"title": "Reactive UI on Android with Scala",
		"description_html": "Reactive programming can bring many benefits to mobile application development, especially when implementing UI. User interfaces developed this way are naturally responsive and code tends to be much more concise, which leads to easier development and less bugs. Reactive Extensions is became quite popular among Android developers recently, unfortunately creating UI with this library tends to be very unnatural, partially due to Java language limitations. Using Scala and techniques borrowed from Functional Reactive Programming we can achieve much better results. This talk is not going to be about Scala itself, nor about using Scala on Android. This talk is going to show how we can use Scala to implement UI in reactive fashion, achieving better results, with less code. There will be quite a lot of Scala code, but it should be accessible for Java developers.",
		"speakers_keys": ["speaker-zbigniew-szymanski"],
		"language": "EN"
	},
	"talk-ionic-io-services-for-hybrid-mobile-applications": {
		"title": "ionic.io - services for hybrid mobile applications",
		"description_html": "ionic.io - usługi dla hybrydowych aplikacji mobilnych W prezentacji przedstawię możliwości platformy ionic.io oraz ich wykorzystanie w hybrydowej aplikacji mobilnej. Podzielę się także nowościami ze świata Ionic i powiem parę słów o inicjatywie Ionic Poland. ionic.io - services for hybrid mobile applications In the presentation I will introduce service of the ionic.io platform and show how to use it in hybrid mobile applications. I'm going to share news from the ionic world and introduce Ionic Poland.",
		"speakers_keys": ["speaker-lukasz-olejarczuk"],
		"language": "PL"
	},
	"talk-angular-js-i-cordova-tworzenie-hybrydowych-aplikacji-mobilnych": {
		"title": "AngularJS i Cordova - tworzenie hybrydowych aplikacji mobilnych",
		"description_html": "Prelekcja dotycząca programowania urządzeń mobilnych z wykorzystaniem AngularJS na systemy iOS, Android i Windows Phone z wykorzystaniem Cordova / Phonegap. Poruszone będą następujące tematy: wstęp do tworzenia hybrydowych aplikacji mobilnych, wykorzystanie AngularJS w budowie aplikacji webowych, zwiększanie wydajności aplikacji hybrydowych, zalecane narzędzia i biblioteki, typowe i nietypowe pułapki i sposoby ich rozwiązywania. Na koniec wystąpienia przewidziana dyskusja z uczestnikami.",
		"speakers_keys": ["speaker-krzysztof-scira"],
		"language": "PL"
	},
	"talk-titanium-develop-native-mobile-apps-with-javascript": {
		"title": "Titanium: Develop Native Mobile Apps with JavaScript",
		"description_html": "Forget about the whole Mobile Web versus Native Apps debate; if you already (truly) know JavaScript then you can use those Web skills to create Native Apps! Titanium is a cross-platform proxy between JavaScript and the iOS, Android and Windows Native API's. Unlike some other solutions this allows you not only to access potentially any system API like that for Geolocation, but also use Native UI Components to build truly Native Interfaces. You wil be introduced to Titanium and see how easy it is to get started via actual code samples and live cross-platform demos. Bring your JavaScript skills and you will leave this presentation as a Native Mobile App Developer!",
		"speakers_keys": ["speaker-fokke-zandbergen"],
		"language": "EN"
	},
	"talk-modern-ios-app-architecture": {
		"title": "Modern iOS App Architecture",
		"description_html": "Programowanie aplikacji na iOS zmieniają się z roku na roku wraz z rozwojem języka Objective-C, wprowadzenia nowego języka Swift jak i niezliczonych ulepszeń bibliotek wchodzących w skład iOS SDK. Prezentacja pokaże najlepsze praktyki jakie współczesne aplikacje powinny wykorzystywać.",
		"speakers_keys": ["speaker-michal-tuszynski"],
		"language": "PL"
	},
	"talk-what-s-in-it-for-us-after-the-indiepocalipse": {
		"title": "What’s in it for us after the Indiepocalipse?",
		"description_html": "We’re an indie iOS studi of two. We released our first iPhone app for iOS 3.1 and we kept putting out small fun apps for the next five years. Times were good and we thought it’s always gonna be like this in the App Store. Apple isn’t into indies anymore and the App Store is a slaughterhouse. Tons of developers are in a kind of limbo - why is this happening and what to do after the Indiepocalipse is over? What is the next logical step - try harder on the App Store, pivot, change platforms? But now that the Indiepocalipse is upon us. Or is it?",
		"speakers_keys": ["speaker-marin-todorov"],
		"language": "EN"
	},
	"talk-developing-software-for-dedicated-devices-using-agile": {
		"title": "Developing Software for Dedicated Devices using Agile",
		"description_html": "Agile methodologies like SCRUM, DaD and SAFe help us to effectively develop software products. But when developing software for dedicated devices for the consumer market such as navigation devices, watches and multimedia systems you need some adaptation to make it work. I’ll guide you through the world of software engineering using the principles of the SAFe framework (with some adaptations), starting from running Android on your device till having a final product in she shops. And of course some do’s – don’ts, tools that you could use and much more.",
		"speakers_keys": ["speaker-edwin-adriaansen"],
		"language": "EN"
	},
	"talk-dont-reinvent-the-wheel-use-libraries-modern-android-stack": {
		"title": "Don't reinvent the wheel, use libraries: Modern Android Stack",
		"description_html": "Use of libraries gives you speed and smaller error rate than writing everything by yourself. In this talk you gonna learn about how to use modern libraries that make your developer life easier. From Timber through Picasso, ButterKnife to RoboSpice, Dagger2 and few other libs you gonna learn about modern approach to build Android apps that make your customers happy.",
		"speakers_keys": ["speaker-pawel-junak"],
		"language": "EN"
	},
	"talk-unit-testy-w-androidzie-z-uzyciem-biblioteki-spock": {
		"title": "Unit Testy w Androidzie z użyciem biblioteki Spock",
		"description_html": "Chciałbym pokazać jak w łatwy, prosty i przyjemny sposób można pisać Unit Testy na platformę Android z użyciem biblioteki Spock. Mój wykład pokazuję w jaki sposób konfigurować a potem tworzyć test w groovy-m dla Androidowego projektu.",
		"speakers_keys": ["speaker-konrad-krakowiak"],
		"language": "PL"
	},
	"talk-android-data-binding-nie-tylko-w-teorii": {
		"title": "Android Data Binding nie tylko w teorii",
		"description_html": "Data Binding na Androidzie - zalety, wady, przykłady użycia. Demonstracja biblioteki ułatwiającej (u)życie.",
		"speakers_keys": ["speaker-sebastian-kacprzak"],
		"language": "PL"
	},
	"talk-xamarin-dla-nie-tylko-deweloperow-androida": {
		"title": "Xamarin dla (nie tylko) deweloperów Androida",
		"description_html": "W ramach moich przygotowań do warsztatu o Xamarinie na codepot.pl 2015 powstała prezentacja o tym czym właściwie ta platforma jest. Często, mylnie, mówi się że Xamarin to kolejna hybrydowa technologia, zupełnie jak, fuj, cordova.W ramach prezentacji dowiemy się:<br/>- co to właściwie jest Xamarin<br/>- czy to druga, równie kiepska, technologia co Cordova<br/>- co właściwie jest natywne (platform-specific) a co można współdzielić między projektami<br/>- jakie natywne komponenty są dostępne (UIKit dla iOS, RecycleView czy Support Library dla Androida)<br/>- czy to jest wreszcie to rozwiąznie gdzie piszemy raz a działa wszędzieBędę szczęśliwy jeśli w czasie prezentacji iOS-owcy pomyślą sobie \"o fajnie, normalnie mam tam UIKit i moge nawet pisać kawałki w Objective-C\", a Androidowcy westchną \"o super, jest wspierana najnowsza wersja Support Library, już tydzień po wydaniu\".",
		"speakers_keys": ["speaker-aleksander-piotrowski"],
		"language": "PL"
	},
	"talk-material-design-with-android-design-library": {
		"title": "Material design with Android Design Library",
		"description_html": "At Google I/O 2015 the Material Design Support Library was announced, and with it creating material apps suddenly got a lot easier. With a little help from the new Android Design Support Library, we are getting a number of important material design components to all developers and to all Android 2.1 or higher devices. In this talk I will show most important components of design library from developer point of view. I will show how to start and what may be unintuitive in the begining.",
		"speakers_keys": ["speaker-karol-kowalski"],
		"language": "PL"
	},
	"talk-optymalizacja-hierarchii-widokow-na-platformie-android": {
		"title": "Optymalizacja hierarchii widoków na platformie Android",
		"description_html": "Optymalizacja hierarchii widoków na przykładzie aplikacji \"Stereoscopic Image Calculator\". Zrozumienie sposobu renderowania widoków jako podstawa do opracowywania wydajnych aplikacji na platformę Android. Agenda prezentacji: <ol><li>Motywacja (aplikacja \"Stereoscopic Image Calculator\", która na poszczególnych ekranach wyświetlała bardzo dużo danych)</li> <li>Szczegóły techniczne dotyczące renderowania widoków: Co się dzieje, jeżeli zostanie wywołana metoda \"requestLayout()\"?<br/>Jakie kluczowe metody i w którym momencie są wywoływane podczas renderowania widoków na ekranie? Na co zwracać szczególną uwagę przy tworzeniu widoków?</li> <li>Pisanie własnych \"ViewGroup\"</li> <li>Narzędzie \"HierarchyViewer\"</li> <li>Pomiary i wnioski</li></ol>",
		"speakers_keys": ["speaker-michal-wlodarczyk"],
		"language": "PL"
	},
	"talk-potrzeby-biznesowe-a-technologia-w-mobdev-na-przykladzie-seqr": {
		"title": "Biznes a technologia w mobdev SEQR case study",
		"description_html": "Specjaliści z dziedziny rozwoju produktu, użyteczności i technologii opowiedzą:- W jaki sposób warto planować rozwój ekosystemu usług płatniczych w sytuacji, gdy potrzeba jak najszybciej adaptować się do zmieniającego się rynku, potrzeb użytkowników i działań konkurencji.<br/>- Jak skalujemy SCRUM by dobrze koordynować pracę wielu zespołów.<br/>- Dlaczego stawiamy na jak najszybsze zmiany (i ewentualne niepowodzenia) i jak się to nam udaje.<br/>- Dotychczasowa implementacja Lean Startup - doświadczone pętle zwrotne między strategią biznesową, UX, a zastosowaną technologią.<br/>- Dlaczego User Experience jest tak ważny - jaką wartość biznesową daje w przypadku SEQR.",
		"speakers_keys": ["speaker-daniel-rurarz",
		"speaker-lukasz-szadkowski",
		"speaker-michal-majcherski"],
		"language": "PL"
	},
	"talk-czy-nastala-era-continuous-everything": {
		"title": "Czy nastała era \"continuous everything\"? Przewodnik po bezustannym procesie tworzenia aplikacji mobilnych na przykładzie Matrix42 Mobile [case study]",
		"description_html": "Przedstawienie idei medotologii \"continiuous\", skupiając się na aspektach: integration, development, delivery, testing i wszystich pozostałych, wykorzystywanych w tworzeniu aplikacji mobilnych na przykładzie Matrix42 Mobile, wdrażanej na platformy Android oraz iOS. Kilka słów wprowadzających w połączeniu z przykładami wykorzystania w procesie developmentu - przybliżenie narzędzi oraz sposobu ich wykorzystania w codziennej pracy. Dodatkowo kilka zdań na tematy pokrewne niezwykle ważne dla użytkownika końcowego, czyli \"BYOD - Private Devices, Company Content\" oraz \"Mobile Management\".Link <a href='https://play.google.com/store/apps/details?id=com.matrix42.m42mobileLink'>Android</a>,<a href='https://itunes.apple.com/pl/app/m42mobile/id430536897?mt=8'>iOS</a>",
		"speakers_keys": ["speaker-pawel-wojdera"],
		"language": "PL"
	},
	"talk-html5-goes-for-a-ride-czyli-wyzwania-dla-technologii-webowych-w-przemysle-automotive": {
		"title": "HTML5 goes for a ride - Czyli wyzwania dla technologii webowych w przemyśle automotive",
		"description_html": "Biorąc pod uwagę fakt, że samochody należą do konstrukcji dość mobilnych było jedynie kwestią czasu kiedy trafi tam HTML5. Tradycyjne środowisko tej technologii dawno przestało przestało być jedynym.Jak jednak wygląda tworzenie aplikacji typu IVI (In-vehicle infotainment)? Czym ekran w aucie różni się od tabletu?Opowiem o wyzwaniach jakie stawia przed HTML5 rynek automotive oraz innych doświadczeniach specyficznych dla tej platformy. W części praktycznej zaprezentuje różnice w działaniu demonstracyjnej aplikacji, na zbliżonym do docelowego sprzęcie, w porównaniu z urządzeniami mobilnymi i PC.",
		"speakers_keys": ["speaker-lena-rodziewicz"],
		"language": "PL"
	},
	"talk-hacking-bluetooth-smart": {
		"title": "Hacking Bluetooth Smart",
		"description_html": "Rozłożymy na czynniki pierwsze bezpieczeństwo jednej z najpopularniejszych, a zarazem najbliższej aplikacjom mobilnym technologii związanej z Internet of Things: Bluetooth Smart. Jak zwykle z pomocą niezawodnej publiczności Mobilization, na rzeczywistych przykładach krok po kroku wspólnie zaatakujemy kolejne urządzenia: m.in. beacony, opaskę sportową, samochód. Analizując warunki i skutki ataków ustalimy wpływ na ryzyko konkretnych podatności, i zastanowimy się w jakich przypadkach bezpieczeństwo będzie naprawdę istotne. Uczestnicy wyniosą spojrzenie intruza na nową technologię oraz jej ograniczenia, co pozwoli projektować bezpieczniejsze rozwiązania.",
		"speakers_keys": ["speaker-slawomir-jasek"],
		"language": "PL"
	},
	"talk-hunt-me-od-kuchni-jak-powstal-innowacyjny-sposob-na-szukanie-pracy": {
		"title": "Hunt Me od kuchni - jak powstał innowacyjny sposób na szukanie pracy",
		"description_html": "Podczas prelekcji opowiemy jak powstał projekt angażujący 3 niezależne zespoły developerskie.Tematami na których się skupimy będzie organizacja pracy nad aplikacją powstającą w 3 różnych miejscach i z wykorzystaniem 3 różnych platform, oraz część wspólna dla wszystkich obsługiwanych platform, czyli API po stronie serwera. Przy jego tworzeniu z powodzeniem integrowaliśmy różnorodne technologie (WebAPI, OAuth), korzystaliśmy z istniejących bibliotek zewnętrznych (Ninject, EF) i stworzonych w Grupie Pracuj (GP.Juno, EndpointSwitcher). Opowiemy też o tym co niewidoczne - czyli architekturze, WebAPI jako rozbudowanym proxy i funkcjonowaniu na w rozproszonym środowisku. Zapraszamy!",
		"speakers_keys": ["speaker-maciej-chwiloc",
		"speaker-cezary-kapicki"],
		"language": "PL"
	},
	"talk-android-auto": {
		"title": "Android Auto",
		"description_html": "Aplikacja Android Auto stworzona została, aby umożliwić dostęp do głównych funkcji smartphona przy zachowaniu maksimum bezpieczeństwa w trakcie jazdy. Kontrolowanie nawigacji, odtwarzacza audio, telefonu i wiadomości bezpośrednio z wbudowanego ekranu przy użyciu głosu i przycisków na kierownicy pozwala skupić się na drodze i zminimalizować niebezpieczeństwo związane z obsługą smartphona.Podczas prezentacji pokażemy działającą implementację Android Auto wraz z krótkim omówieniem funkcjonalności, a także przeprowadzimy Państwa przez proces tworzenia aplikacji umożliwiającej komunikację z kierowcą w trakcie jazdy.",
		"speakers_keys": ["speaker-anton-miniailo",
		"speaker-jacek-rondio"],
		"language": "PL"
	},
	"talk-co-kryje-pianka-czyli-o-nowej-wersji-androida": {
		"title": "Co kryje Pianka, czyli o nowej wersji Androida.",
		"description_html": "Pewnie każdy fan i developer Androida oglądał Google I/O, podczas którego usłyszał o zmianach M-ki. Nowy sposób zarządzania permission'ami oraz doze mode to tylko nieliczne zmiany, które nowa wersja wprowadza. Poznaj jakie zmiany powinieneś(aś)  zrobić, by Twoja aplikacja  nadal poprawnie działała na Androidzie 6.0 (Marshmallow) .  Ta prelekcja uwzględnia wiele nowości i zmian o których Google nie wspomina, nie daj się zaskoczyć ... przyjdź.",
		"speakers_keys": ["speaker-michal-szczepanik"],
		"language": "PL"
	},
	"talk-no-platformy-natywne": {
		"title": "Porzuć platformy natywne! Czyli czemu HTML5 jest lepszy.",
		"description_html": "Skoro to czytasz, to znaczy że tytuł zadziałał. Tak na prawdę nie twierdzę że HTML5 jest lepszy. On jest inny, a to można wykorzystać w naszej pracy, jaką jest dostarczanie gotowych, działających rozwiązań klientom.Podczas prezentacji chcę poruszyć temat zalet, wad i różnic w programowaniu aplikacji klienckich na platformy natywne i webowe. Przedstawię powody czemu moim zdaniem większość MVP można wykonywać przy użyciu HTML5 zamiast technologii natywnych.Dla uwiarygodnienia mojej tezy planuję wykonać odrobinę live-codingu.",
		"speakers_keys": ["speaker-tomasz-netczuk"],
		"language": "PL"
	},
	"talk-ux-pitfalls-in-multi-os-apps": {
		"title": "UX pitfalls in multi-os apps",
		"description_html": "In this session we will answer simple but demanding questions: </br>- Is UX really device agnostic? </br>- What should be our approach when designing a multi-OS or multi-platform apps? </br>- Is the philosophy “design once – run anywhere” still alive? </br> We will take you on a short journey from a simple idea to the mockup realization. Be prepared for silly ideas, tricky questions and unconventional approach to challenges awaiting you in the design process.",
		"speakers_keys": ["speaker-rafal-szpoton",
		"speaker-sebastian-gos",
		"speaker-lech-migdal"],
		"language": "EN"
	},
	"talk-kiedy-zespol-scrumowy-nie-kocha-swojego-produktu-mobilnego": {
		"title": "Kiedy zespół Scrumowy nie kocha swojego produktu mobilnego",
		"description_html": "Celem prezentacji jest przedstawienie różnych technik (w tym metod Agile UX), które mogą sprawić, że zespół Scrumowy bardziej zaangażuje się w produkt i nie skupi tylko na realizacji oczekiwań Product Ownera w określonych odcinkach czasu. Jak sprawić, żeby członkowie zespołu scrumowego utożsamiali się z produktem, który tworzą, co jest szczególnie trudne w dużych organizacjach? Prezentacja oparta na doświadczeniach i eksperymentach przeprowadzonych w kilku zespołach Scrumowych, pracujących nad takimi projektami, jak aplikacja mobilna czy strona responsywna.",
		"speakers_keys": ["speaker-michal-aleksander"],
		"language": "PL"
	},
	"talk-zwinna-lodz-przedstawia-panel": {
		"title": "Jeden zespół czy zespół per platforma?",
		"description_html": "Panel dyskusyjny oparty na konkretnych case studies organizowany przez grupę Zwinna Łódź.<br>Czy interdyscyplinarność w jednym zespole ma dobry wpływ na tworzenie nowych funkcjonalności? Jak wygodnie synchronizować pracę, gdy kilka zespołów różnych platform tworzy jeden produkt? Zalety i wady, czyli które podejście jest bardziej korzystne?",
		"speakers_keys": ["speaker-pawel-urban",
		"speaker-lukasz-krupa",
		"speaker-pawel-wojdera",
		"speaker-filip-miloszewski"],
		"language": "PL"
	}
}